pmo-dataset/graphviz/38.dot
digraph G {
  rankdir=LR;  
  node [shape=box];

  "wish to build a\nhouse" -> "Collect requirements";
  "Send requirements" -> "draft received";
  "Create order list" -> "Place order";
  "draft received" -> "Check feasibility";
  "Refine requirements" -> "ExclusiveGateway_1";
  "ExclusiveGateway_1" -> "Send requirements";
  "Collect requirements" -> "ExclusiveGateway_1";
  "Subject to approval?" -> "Report for builing\npermit" [label="Yes"];
  "Draft sufficient?" -> "Subject to approval?" [label="Yes"];
  "Draft sufficient?" -> "Refine requirements" [label="No"];
  "Report for builing\npermit" -> "ExclusiveGateway_2";
  "Subject to approval?" -> "ExclusiveGateway_2" [label="No"];
  "ExclusiveGateway_2" -> "Create order list";
  "Place order" -> "Calculate effort";
  "Calculate effort" -> "ParallelGateway_1";
  "Check feasibility" -> "Draft sufficient?";
  "ParallelGateway_1" -> "Get order";
  "ParallelGateway_1" -> "Affordable?";
  "Affordable?" -> "Call friends" [label="No"];
  "Affordable?" -> "Hire building\ncompany" [label="Yes"];
  "Call friends" -> "ExclusiveGateway_3";
  "Get order" -> "ParallelGateway_2";
  "ExclusiveGateway_3" -> "ParallelGateway_2";
  "ParallelGateway_2" -> "Build house";
  "Build house" -> "finished house";
  "Hire building\ncompany" -> "ExclusiveGateway_3";
  "Send requirements" -> "Pool_2" [style=dashed, arrowhead=open];
  "Pool_2" -> "draft received" [style=dashed, arrowhead=open];
  "Pool_3" -> "Get order" [style=dashed, arrowhead=open];
  "Place order" -> "Pool_3" [style=dashed, arrowhead=open];

  subgraph "cluster_Pool_1" {
    label="Customer";

    subgraph "cluster_Lane_1" {
      label="";
      "Send requirements";
      "Collect requirements";
      "wish to build a\nhouse";
      "Refine requirements";
      "Create order list";
      "draft received";
      "Place order";
      "Draft sufficient?";
      "ExclusiveGateway_1";
      "Report for builing\npermit";
      "Subject to approval?";
      "ExclusiveGateway_2";
      "Calculate effort";
      "Check feasibility";
      "ParallelGateway_1";
      "Affordable?";
      "Call friends";
      "Get order";
      "ParallelGateway_2";
      "Build house";
      "finished house";
      "ExclusiveGateway_3";
      "Hire building\ncompany";
    }
  }

  subgraph "cluster_Pool_2" {
    label="Architect";
    "Pool_2" [shape=point, style=invis];
  }

  subgraph "cluster_Pool_3" {
    label="Online stores";
    "Pool_3" [shape=point, style=invis];
  }

  "wish to build a\nhouse" [shape=circle];
  "finished house" [shape=circle, penwidth=4];
  "draft received" [shape=doublecircle];
  "Get order" [shape=doublecircle];
  "Draft sufficient?" [shape=diamond];
  "ExclusiveGateway_1" [label="X", shape=diamond];
  "Subject to approval?" [shape=diamond];
  "ExclusiveGateway_2" [label="X", shape=diamond];
  "Affordable?" [shape=diamond];
  "ExclusiveGateway_3" [label="X", shape=diamond];
  "ParallelGateway_1" [label="+", shape=diamond];
  "ParallelGateway_2" [label="+", shape=diamond];
}
